app/controllers/pages_controller.rb

  def get_recipe
    category_url = "http://cookpad.com/category/10"
    page_number = 1

    opts = {
      :skip_query_strings => false,
      :depth_limit => 1,
    }

    recipes = []

    page_number.times { |number|
      recipe_url = category_url + "?page=" + number.to_s
      Anemone.crawl(recipe_url, opts) do |anemone|
        anemone.focus_crawl do |page|
            page.links.keep_if { |link|
                link.to_s.match(/recipe/)
            }
        end
        anemone.on_every_page do |page|
            begin
                r = {}
                r[:ulr] = page.url.to_s
                r[:title] = page.doc.xpath('//*[@id="recipe-title"]/h1/text()').shift.content.strip if page.doc
                r[:image_ulr] = page.doc.xpath('//*[@id="main-photo"]/img').shift.attributes['src'].value
                r[:summary] = page.doc.xpath('//*[@id="description"]/text()').shift.content.strip
                r[:num_tsukurepo] = page.doc.xpath('//*[@id="tsukurepo"]/div[1]/div[1]/span[1]').shift.content.strip
            rescue
                next
            end
            recipes << r
---
INSERT INTO "recipes" ("created_at", "image_ulr", "ingredients_list", "kind", "num_tsukurepo", "servings_for", "site", "steps", "summary", "title", "ulr", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    recipe = Recipe.find params[:id]
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]

  def show_all
    @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes" ORDER BY num_tsukurepo DESC